package salimi.mohamad.aragenejetpack.screens

import androidx.compose.animation.core.Animatable
import androidx.compose.animation.core.animateFloatAsState
import androidx.compose.animation.core.tween
import androidx.compose.foundation.Image
import androidx.compose.foundation.background
import androidx.compose.foundation.gestures.detectTapGestures
import androidx.compose.foundation.gestures.detectTransformGestures
import androidx.compose.foundation.layout.Arrangement
import androidx.compose.foundation.layout.Box
import androidx.compose.foundation.layout.Column
import androidx.compose.foundation.layout.PaddingValues
import androidx.compose.foundation.layout.Row
import androidx.compose.foundation.layout.Spacer
import androidx.compose.foundation.layout.fillMaxSize
import androidx.compose.foundation.layout.fillMaxWidth
import androidx.compose.foundation.layout.height
import androidx.compose.foundation.layout.padding
import androidx.compose.foundation.layout.size
import androidx.compose.foundation.layout.width
import androidx.compose.foundation.lazy.LazyColumn
import androidx.compose.material3.Text
import androidx.compose.runtime.Composable
import androidx.compose.runtime.LaunchedEffect
import androidx.compose.runtime.getValue
import androidx.compose.runtime.mutableStateOf
import androidx.compose.runtime.remember
import androidx.compose.runtime.rememberCoroutineScope
import androidx.compose.runtime.setValue
import androidx.compose.ui.Alignment
import androidx.compose.ui.Modifier
import androidx.compose.ui.geometry.Offset
import androidx.compose.ui.graphics.Color
import androidx.compose.ui.graphics.graphicsLayer
import androidx.compose.ui.graphics.painter.Painter
import androidx.compose.ui.input.pointer.pointerInput
import androidx.compose.ui.res.colorResource
import androidx.compose.ui.res.painterResource
import androidx.compose.ui.text.ParagraphStyle
import androidx.compose.ui.text.SpanStyle
import androidx.compose.ui.text.TextStyle
import androidx.compose.ui.text.buildAnnotatedString
import androidx.compose.ui.text.font.Font
import androidx.compose.ui.text.font.FontFamily
import androidx.compose.ui.text.style.TextAlign
import androidx.compose.ui.text.style.TextDirection
import androidx.compose.ui.text.withStyle
import androidx.compose.ui.tooling.preview.Preview
import androidx.compose.ui.unit.dp
import androidx.compose.ui.unit.sp
import kotlinx.coroutines.launch
import salimi.mohamad.aragenejetpack.R

@Preview(showBackground = true)
@Composable
fun SuperMixScreen() {

    val longText1 = buildAnnotatedString {
        // وسط‌چین کردن فقط این خط
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("ﺑﺎ عرض ﺳﻼم\n")
        }
        pop() // پایان استایل پاراگراف

        // خطوط دیگر بدون وسط‌چین
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "این پروتکل به عنوان راهنما و دستورالعمل استفاده از سوپرمیکس ۲۰ درصد، برای حصول افزایش وزن بیشتر در مقایسه " +
                        "با روشهای رایج پرواربندی بره تنظیم شده است. قبل از توضیح روش پرواربندی، لازم است چند نکته را مد نظر داشته باشید:\n" +
                        "اول اینکه سوپرمیکس 20% به عنوان یک مکمل پروتئینه-معدنی با فرمولاسیون خاص شرکت آراژن می باشد و به تنهایی " +
                        "پاسخگوی نیاز بره های پرواری نیست.\n\n" +
                        "ثانیا روش تغذیه با سوپرمیکس 20% سیستم تغذیه ای جدیدی است که در این دستورالعمل به تفصیل به آن پرداخته شده است. " +
                        "بنابراین، لطفاً خارج از دستورالعمل حاضر برای تغذیه دام\u200Cهایتان اقدامی انجام ندهید و صرفا با کارشناسان شرکت مشورت " +
                        "نمایید.\n\n" +
                        "ثالثا لطفاً توجه کنید که از لحاظ زمانبندی، سیستم تغذیه آراژن به ۲ دوره سازگاری (عادت دهی) و دوره اصلی پرواربندی " +
                        "تقسیم می\u200Cشود.\n\n" +
                        "در هر دو دوره، بره\u200Cهای پرواری از کنسانتره تهیه شده با سوپرمیکس و علوفه تغذیه می\u200C شوند و یکی از اهداف و " +
                        "ویژگی های این سیستم پرواربندی این است که با رسیدن به انتهای دوره سازگاری، میزان مصرف روزانه علوفه به حداقل\n" +
                        "برسد. از طرف دیگر، توجه داشته باشید که برای ساخت کنسانتره، به دانه کامل (سالم) غلات نیاز است. غلات مورد استفاده " +
                        "برای کنسانتره شامل گندم، جو و ذرت می باشد.\n"
            )
        }

        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 18.sp,
                color = Color.Red // رنگ قرمز
            )
        ) {
            append("توجه")
        }
        pop()
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "نگران استفاده از دانه کامل برای تغذیه بره ها نباشید چرا که تحقیقات و بررسی\u200Cهای ما نشان داده است که طبق این\n" +
                        "روش میزان دفع دانه کامل در مدفوع نزدیک به صفر است و هضم و جذب دانه\u200Cها به صورت کامل صورت می\u200Cگیرد.\n\n" +
                        "میزان خوراک مصرفی روزانه برههای پرواری حدود 4 درصد وزن بدن میباشد و مصرف کنسانتره به صورت متوسط\n" +
                        "بسته به وزن شروع پروار بین ۱.4 الی ۲ کیلوگرم در روز و ۱۲۰ الی ۱۴۰ کیلوگرم در طی دوره پرواربندی می\u200Cباشد. از\n" +
                        "این مقدار ۱۲۰ الی ۱۴۰ کیلوگرم کنسانتره حدود ۲۰ درصد سوپرمیکس، ۲۰ درصد گندم، 25 درصد جو و 35 درصد\n" +
                        "ذرت می\u200Cباشد.\n"
            )
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 18.sp,
                color = Color.Red // رنگ قرمز
            )
        ) {
            append("احتیاط")
        }
        pop()
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "دوباره تاکید می\u200Cشود که غلات باید به صورت کامل و سالم بوده و از غلات آرد شده استفاده نکنید.\n" +
                        "بسته به وزن شروع و پایان پرواربندی، مقدار یونجه و کاه مورد نیاز هر دام در طول دوره ۱۵ الی ۲۰ کیلوگرم در نظر\n\n" +
                        "گرفته شود.\n"
            )
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("خرید و انتخاب بره برای پرواربندی\n")
        }
        pop()
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "توجه کنید که برای پرواربندی، بره\u200Cهایی را تهیه نمایید که شیر سوز نباشند. بره های شیرسوز دارای جثه کوچک،" +
                        "استخوان بندی ضعیف پشم\u200Cهای ژولیده و درهم رفته و رنگ پریده هستند. در نژادهای دنبه\u200Cدار بره\u200Cهای شیر سوز این" +
                        "نژادها دارای دنبه\u200Cهای تحلیل رفته و بسیار کوچک هستند. یکی از راه\u200Cهای تشخیص شیرسوز بودن بره، وزن بسیار کم" +
                        "آن نسبت به سن بره می\u200Cباشد. توجه کنید که در بره\u200Cهای نژادهای درشت جثه میزان وزن\u200Cگیری روزانه در حدود ۲۵۰" +
                        "گرم و در نژادهای کوچک جثه میزان وزنگیری بره باید در حدود ۱۵۰ گرم باشد تا بتوان گفت که بره شیرسوز نیست.\n" +
                        "برای مثال در نظر بگیرید که بره چهار ماهه\u200Cای از نژاد افشاری دارای وزن ۱۶ کیلوگرم است. بنابراین، این بره که وزن" +
                        "تولدی در حدود ۴ کیلوگرم داشته و در طول ۴ ماه از زمان تولد تنها ۱۲ کیلو افزایش وزن داشته است. به این معنا که هر" +
                        "ماه ۳ کیلو افزایش وزن داشته و روزانه تقریبا تنها ۱۰۰ گرم به وزن آن افزوده شده است. بنابراین، این بره یک بره " +
                        "شیرسوز می\u200Cباشد. درحالیکه بره 4 ماهه معمولی از نژاد افشاری بایست حداقل 30 تا 35 کیلوگرم وزن داشته باشد.\n\n" +
                        "اولین نکته\u200Cای که باید در خرید بره\u200Cها در نظر بگیرید، ترشحات چشم و بینی می\u200Cباشد. به این معنا که بره دارای ترشحات " +
                        "چشم و بینی می\u200Cتواند علائمی از مبتلا بودن به انگل و یا پنومونی از خود نشان دهد که در بسیاری از موارد توسط " +
                        "دامپزشک قابل درمان است، اما در پرواربندی می\u200Cتواند مدت زمان پرواربندی را افزایش دهد، پس بنابراین، اگر " +
                        "می\u200Cخواهید بره پای پروار بخرید، حیوان دارای ترشحات بینی و چشم را انتخاب نکنید. بره\u200Cها نباید دارای غده\u200C های چرکی" +
                        "در قسمت کشاله ران یا سردست و اطراف گوش باشند. توجه داشته باشید که بره\u200Cها نباید دارای عفونت\u200Cهای مفاصل باشند، " +
                        "این عفونت\u200Cها بیشتر در قسمت بالای سم ایجاد شده و موجب لنگش در بره\u200Cها می\u200Cشوند و به احتمال زیاد توانایی آلوده " +
                        "کردن کل گله را دارند.\n\n" +
                        "دهان بره\u200Cها را به صورت دقیق بررسی کرده تا از عدم وجود زخم در قسمت لب، لثه و یا زبان مطمئن شوید، این زخم\u200Cها " +
                        "نشان دهنده بیماری\u200Cهای مانند تب برفکی، طاعون نشخوار کنندگان کوچک، و اکتیما هستند. هر سه این بیماری\u200Cها موجب " +
                        "تلفات شده و افزایش وزن روزانه بره\u200Cها را به شدت تحت تاثیر قرار می\u200Cدهند.\n\n" +
                        "بره\u200Cها را از لحاظ عدم وجود کنه در قسمت داخلی پاهای جلویی و قسمت داخلی گوش\u200Cها و دنبالچه حیوان مورد بررسی " +
                        "قرار دهید. سعی کنید بره\u200Cهایی تهیه کنید که نیاز به درمان خاصی نداشته باشند. مثلاً بره\u200Cها دچار بیماری\u200Cهای پوستی مانند " +
                        "قارچ و جرب نباشند. هرچند این بیماری\u200Cها قابل درمان هستند، ولی هزینه کارگری و دارو و درمان را به واحد تولیدی " +
                        "تحمیل می\u200Cکنند.\n\n" +
                        "نکته مهم در خرید بره\u200Cهای پرواری، توجه به اسکلت آنها می\u200Cباشد، هرچه اندازه اسکلت بره\u200Cها درشت تر باشد، میانگین " +
                        "افزایش وزن روزانه آنها بیشتر خواهد بود. \n\n"
            )
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("وزن شروع پرواربندی\n")
        }
        pop()
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "برای پرواربندی توصیه می\u200Cشود از بره\u200Cهای بزرگ جثه از نژاد افشاری، قزل افشار، قره قزل، لری بختیاری، شال،" +
                        "مغانی و... استفاده شود. نژادهای خارجی مانند لاکن، رومن و اصف که در دامداری کنونی کشور جایگاه پیدا کردند نیز" +
                        "جزو نژادهای مناسب پروار محسوب می\u200Cشوند. وزن شروع برای پرواربندی در نژادهای بزرگ جثه بین 35 تا 37 " +
                        "کیلوگرم مناسب است.\n" +
                        "اما برای انتخاب بره به منظور پرواربندی یک قانون کلی را در نظر بگیرید و آن اینکه، بره\u200Cهایی که دارای استخوان " +
                        "بندی درشت و سالم هستند ولی از لحاظ عضلانی لاغر می\u200Cباشند، اولویت اول در خرید و انتخاب بره پای پروار هستند.\n" +
                        "توجه نمایید که این نکته برای دام\u200Cهای کوچک جثه نیز صادق است.\n"
            )
        }

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "برای پرواربندی توصیه می\u200Cشود از بره\u200Cهای بزرگ جثه از نژاد افشاری، قزل افشار، قره قزل، لری بختیاری، شال،" +
                        "مغانی و... استفاده شود. نژادهای خارجی مانند لاکن، رومن و اصف که در دامداری کنونی کشور جایگاه پیدا کردند نیز" +
                        "جزو نژادهای مناسب پروار محسوب می\u200Cشوند. وزن شروع برای پرواربندی در نژادهای بزرگ جثه بین 35 تا 37 " +
                        "کیلوگرم مناسب است.\n" +
                        "اما برای انتخاب بره به منظور پرواربندی یک قانون کلی را در نظر بگیرید و آن اینکه، بره\u200Cهایی که دارای استخوان " +
                        "بندی درشت و سالم هستند ولی از لحاظ عضلانی لاغر می\u200Cباشند، اولویت اول در خرید و انتخاب بره پای پروار هستند.\n" +
                        "توجه نمایید که این نکته برای دام\u200Cهای کوچک جثه نیز صادق است.\n"
            )
        }

        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 18.sp,
                color = Color.Red // رنگ قرمز
            )
        ) {
            append("نکته\n")
        }
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "هدف از پرواربندی، تولید گوشت لخم می\u200Cباشد. پس در انتخاب بره\u200Cها حتماً به این نکته توجه کنید که به هیچ عنوان " +
                        "چاق نباشند.\n"
            )
        }
        pop()

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "نژادهای کوچک جثه ایرانی مانند نژاد زل، نایینی، تالشی، بلوچی و ... می\u200Cباشند و نژاد رومانوف نیز به عنوان یک نژاد" +
                        "کوچک جثه خارجی مطرح است. برای دامهای کوچک جثه پرواربندی را از وزن\u200Cهای پایین\u200Cتر به عنوان مثال ۲۰ تا ۲۵ " +
                        "کیلو شروع کنید. این نژادها افزایش وزن روزانه بالایی ندارند ولی در مقابل مقدار خوراک مصرفی آنها نیز کمتر است.\n" +
                        "ترجیحا بره\u200Cها را در ساعات ابتدایی روز خریداری کنید. چون در این ساعات تشخیص یک سری از بیماری\u200Cها ساده\u200Cتر" +
                        "بوده و فروشنده فرصت چندانی برای خوراندن خوراک بیش از حد به منظور سنگین\u200Cتر شدن حیوان را ندارد. دوباره تاکید " +
                        "می\u200Cکنیم که ملاک انتخاب بره، جثه درشت و لاغر بودن آن است. به عنوان مثال از خرید بره\u200Cهایی که مثلاً ۳۵ کیلو وزن " +
                        "دارند ولی به شدت چاق هستند خودداری کنید.\n" +
                        "بره\u200Cهایی که برای دوره پرواربندی در نظر گرفته می\u200Cشوند دو حالت دارند: یا بره\u200Cهایی هستند که از زمان تولد در " +
                        "دامداری خودتان بودند و اکنون تصمیم به پرواربندی آنها گرفته\u200Cاید و یا بره\u200Cهایی هستند که به منظور پرواربندی خریداری " +
                        "شدند.\n" +
                        "پس از آنکه تصمیم به پرواربندی در دامداری گرفتید و بره\u200Cها برای پرواربندی حاضر شدند، باید اقداماتی را قبل از " +
                        "شروع دوره انجام دهید.\n"
            )
        }

        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("اقدامات مربوط به حمل و نقل\n")
        }
        pop()
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black // رنگ قرمز
            )
        ) {
            append(
                "در صورتی که بره\u200Cها را خریداری کردید و می\u200Cخواهید آنها را به دامداری خودتان حمل کنید، در نظر بگیرید که کاهش " +
                        "وزن و پنومونی دو مشکل عمده در طی فرایند حمل و نقل می\u200Cباشد\u200C. برای کنترل پنومونی می\u200Cتوانید از تزریق اکسی " +
                        "تتراسایکلین ۲۰ درصد ال ای (طولانی الاثر) به میزان توصیه شده توسط شرکت سازنده در بروشور دارو، استفاده " +
                        "کنید. بهتر است این دارو را یک روز قبل از بارگیری حیوان تزریق کنید. توجه کنید که یکی از عوامل اصلی پنومونی\n" +
                        "در معرض باد سرد قرار گرفتن حیوان می\u200Cباشد. بنابراین، برای حمل و نقل در صورت امکان از ماشین\u200Cهای دارای چادر " +
                        "استفاده کنید. عموما کاهش وزن به دلیل حمل و نقل به خاطر دفع ادرار و تخلیه روده حیوان می\u200Cباشد. اما کاهش وزن " +
                        "بیشتر که به دلیل از دست دادن مقداری از عضلات است، توسط مولتی ویتامین\u200Cهای دارای آمینو اسید قابل کنترل است. " +
                        "یکی از این مولتی ویتامین\u200Cها که پاسخ دهی مناسبی داشته است، مولتی آمینوجکت شرکت رویان دارو می\u200Cباشد. لطفا " +
                        "مصرف این دارو نیز مطابق با توصیه شرکت سازنده انجام گیرد. در صورت امکان قبل از حمل و نقل، در آبخوری " +
                        "بره\u200Cهای پای پروار خریداری شده، مقداری مولتی ویتامین دارای الکترولیت (که عموماً برای طیور استفاده می\u200Cگردد) حل " +
                        "شود. این مورد نیز می\u200Cتواند کاهش وزن ناشی از حمل و نقل را در حیوان تا حدی کنترل کند.\n"
            )
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("اقدامات شروع پرواربندی\n")
        }
        pop()

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "اولین اقدامی که برای شروع پرواربندی باید انجام دهید، هویت گذاری (با استفاده از پلاک گوش) و وزنکشی می\u200Cباشد.\n" +
                        "وزن کشی بره\u200Cها را به صورت شکم خالی (18 ساعت قطع خوراک و آب) انجام دهید و وزن تک تک بره\u200Cها را با " +
                        "شماره گوش آنها بنویسید.\n" +
                        "پلاک گوش\u200Cهای پلاستیکی در دامداری\u200Cهایی که از تور مرغی و فنس برای جداسازی فضاها استفاده نمی\u200Cکنند، مناسب " +
                        "است. چنانچه در دامداری\u200Cتان از توری\u200Cهای فلزی استفاده می\u200Cکنید، بهتر است از پلاک گوش فلزی برای هویتگذاری " +
                        "بره\u200Cها استفاده کنید. چنانچه می\u200Cخواهید از پلاک گوش پلاستیکی در دام\u200Cهایتان استفاده کنید، بهتر است پلاک\u200Cها را در " +
                        "قسمت جلویی گوش نصب کنید.\n"
            )
        }
    }
    val longText2 = buildAnnotatedString {
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("کنترل انگل\u200Cهای خارجی\n")
        }
        pop()

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "مهمترین انگل\u200Cهای خارجی که در بره رویت می\u200Cشوند کنه، جرب و کک می\u200Cباشند. کنه موجب ایجاد زردی در بره می\u200Cشود که باعث ایجاد تب و تلفات بالا در بره می¬گردد. جرب نیز آسایش حیوان را به شدت تحت تاثیر قرار داده و باعث کاهش کیفیت پوست و پشم حیوان می\u200Cشود. همچنین امکان سرایت جرب به انسان و حیوانات دیگر بسیار بالاست. کک انگل خارجی دیگری است که می\u200Cتواند موجب کمخونی شدید شود. محل تخمریزی این انگل بستر دامداری بوده و برای کنترل آن باید بستر تخلیه شده و دام سمپاشی شود. هنگام خرید سموم توجه داشته باشید که قابلیت استفاده برای دام و جایگاه را به صورت همزمان داشته باشند.\n\n"
            )
        }

    }

    val longText3 = buildAnnotatedString {

        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 18.sp,
                color = Color.Red // رنگ قرمز
            )
        ) {
            append("نکته\n")
            append(
                "حتما قبل از سمپاشی و یا استفاده از حمام ضد کنه، بره¬ها را کاملا سیراب کنید.\n"
            )
        }
        pop()

        append("برای کنترل کنه، جرب و کک می توان از حمام ضد کنه و یا سمپاشی استفاده کرد.\n")
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                " در روش حمام ضد کنه حیوان در داخل حوضچه\u200Cهایی مخصوص قرار داده می\u200Cشود و پوست و پشم آن شستشو داده می\u200Cشود. به آب این حوضچه\u200Cها سم\u200Cهای مخصوصی مانند سایپرمترین  EC10%، فوکسیم و... اضافه می\u200Cشود. \n" +
                        "روش دیگر برای مبارزه با این انگل\u200Cها، سمپاشی می\u200Cباشد که در این روش سم\u200Cهای ذکر شده به مقدار توصیه شده در بروشور مربوط به آنها با آب ترکیب شده و داخل سمپاش\u200Cهای رودوشی، تراکتوری و یا فرغونی ریخته شده و حیوانات توسط آن سمپاشی می\u200Cگردد. اکیدا، پیشنهاد می\u200Cگردد که بعد از سمپاشی برای کنترل این انگل\u200Cها، از داروی آیورمکتین تزریقی نیز استفاده شود. توجه داشته باشید که هنگام تزریق به هیچ عنوان روی بره\u200Cها خیس و یا مرطوب نباشد. در بعضی از دام\u200Cها بعضاً جرب در یک ناحیه مشخص کوچک از بدن دیده می\u200Cشود. در این مواقع می\u200Cتوان با ریختن مقداری روغن روی ناحیه، جرب را از بین برد. \n" +
                        "نکته قابل توجه اینکه از کندن کنه\u200Cها با دست خودداری کنید به دلیل آنکه برخی از بیماریها از این طریق قابل انتقال به انسان هستند. \n"
            )

        }
    }
    val longText4 = buildAnnotatedString {
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black // رنگ قرمز
            )
        ) {
            append("قارچ پوستی یکی دیگر از مسائلی است که دام\u200Cها گاهاً دچار آن می\u200Cشوند. قارچ\u200Cهای پوستی بیشتر در نواحی مختلف روی سر و صورت حیوان دیده می\u200Cشود. به طوری که وجود قارچ روی لبه\u200Cهای گوش، اطراف چشم، اطراف بینی و سر حیوان باعث پوسته پوسته شدن و ایجاد ضایعات گرد و سکه\u200Cای می\u200Cشود. ")
        }
    }

    val longText5 = buildAnnotatedString {
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append("توجه کنید که بهتر است دام\u200Cهای دارای قارچ پوستی را خریداری نکنید و چنانچه قارچ پوستی در بره\u200Cها مشاهده گردید، برای درمان آن می\u200Cتوانید از محلول لیکودرم و یا پماد جی بی سی به صورت موضعی استفاده کنید. توجه به این دو نکته لازم است که قارچ پوستی یک بیماری مشترک بین انسان و دام می\u200Cباشد و نیز دقت کنید که محلول لیکودرم به چشم بره برخورد نکند.\n")
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("انگل\u200Cهای داخلی\n")
        }
        pop()

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "این انگل\u200Cها، کبد، ریه، روده\u200Cها، گاها عضلات، سیستم عصبی و غیره را درگیر می\u200Cکنند و می\u200Cتوانند باعث کاهش وزن و کاهش آسایش دام شود و نتایج پرواربندی را به شدت تحت تاثیر قرار دهد. برای کنترل انگل\u200Cهای داخلی پیشنهاد ما این است که از شربت\u200Cهای ضد انگل استفاده شود. شربت\u200Cهای آلبندازول و تریکلابندازول+ لوامیزول برای این منظور مناسب است.\n" +
                        "در نظر داشته باشید که تریکلا بندازول + لوامیزول یک شربت با دو ماده موثره می\u200Cباشد. دستورالعمل انگل زدایی به این صورت است که این دو شربت به نسبت یک به یک با یکدیگر ترکیب شده و به ازای هر ۱۰ کیلوگرم از وزن بره ۳ تا ۴ سی سی (بر اساس میزان آلودگی، از روی مقدار ترشحات بینی و...) سه بار به فاصله ۷ روز به بره داده شود. تزریق آیورمکتین همراه با نوبت اول و سوم (آخر) خوراندن شربت\u200Cها به بره توصیه می\u200Cشود. (تمامی داروهای ضدانگل با توجه به منطقه پرورش حیوان و سابقه انگل زدایی، قابل تغییر هستند و هر منطقه اقدامات و داروهای خاص خود را دارد. پس در این خصوص حتما با دامپزشک مشورت نمایید).\n\n"
            )
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("واکسیناسیون\n")
        }
        pop()

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                " برای ورود به دوره پرواربندی نیاز است که بره\u200Cها بعضی از واکسن\u200Cها را دریافت کرده باشند. مهمترین این واکسن\u200Cها انتروتوکسمی یا واکسن پرخوری می\u200Cباشد. چنانچه بره در سه ماه گذشته این واکسن را دریافت کرده است، یک بار تزریقات آنتروتوکسمی انجام گردد و چنانچه در سه ماه گذشته واکسنیاسیون علیه بیماری آنتروتوکسمی انجام نشده است، دو بار با فاصله ۱۴ روز این واکسیناسیون انجام گردد. توصیه می¬شود که از واکسن های خارجی استفاده نمایید .\n" +
                        "تزریق واکسن\u200Cهای اگالاکسی و پی پی آر و... بنابر توصیه و صلاحدید دامپزشک گله باید انجام شود. تزریق واکسن تب برفکی از اهمیت بالایی برخوردار است. لطفا با مشورت دامپزشک تزریق این واکسن را در روزهای اول پرواربندی انجام دهید.\n" +
                        "اقدامات بهداشتی بعدی که شامل پشم چینی و سم چینی می\u200Cباشد، باید در روزهای اول شروع دوره انجام گیرد. قبل از پشم چینی، دام\u200Cها را شستشو داده و سپس اقدام به پشم چینی نمایید. بهتر است پس از حمام ضد کنه و یا سمپاشی، دام\u200Cها را پشم چینی نمود. این موضوع به این دلیل است که اگر دام\u200Cها آلوده به جرب یا کنه باشند و پشم چینی انجام گیرد، احتمال سرایت این انگل\u200Cها  به انسان وجود دارد. بنابراین، بهتر است ابتدا انگل زدایی انجام شده و سپس اقدام به پشم چینی کنید. \n\n"
            )
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("دسته\u200Cبندی بره\u200Cها\n")
        }
        pop()

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append("برای گرفتن نتیجه بهینه در دوره پرواربندی بهتر است بره\u200Cها با اختلاف وزنی حدود 3 کیلوگرم از یکدیگر دسته\u200Cبندی شوند. برای مثال بره\u200Cهای ۳۵ تا 38 کیلوگرم و 38 تا 41 کیلوگرم در آغل\u200Cهای جداگانه قرار داده شوند.\n\n ")
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("دستهآخور، آبشخور و جایگاه\n")
        }
        pop()

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "ابعاد آخور و جایگاه نیز باید متناسب با تعداد بره\u200Cهای پرواری در نظر گرفته شود. طول آخور برای هر راس بره ۳۵ سانتی\u200Cمتر و عرض آن ۲۵ تا ۳۰ سانتی\u200Cمتر در نظر گرفته شود. بنابراین، اگر از آخور دو طرفه استفاده می\u200Cکنید هر ۳۵ سانتی\u200Cمتر از طول آن برای دو بره کافی است و توجه کنید که عرض آخورهای دو طرفه بین ۵۵ تا ۶۰ سانتی\u200Cمتر باشد. ارتفاع دیواره جلویی آخور بین ۳۰ تا ۳۵ سانتی\u200Cمتر باید باشد و ارتفاع کف آخور از لبه دیواره جلویی ۲۰ تا ۲۵ سانتی\u200Cمتر در نظر گرفته شود. در صورتی که کف آخور هم سطح زمین باشد دیواره جلویی آخور باید ۱۰ تا ۱۵ سانتی\u200Cمتر کمتر در نظر گرفته شود. دیواره پشتی آخور چنانچه دامداری دارای راهروی مرکزی باشد بهتر است ۶۰ سانتی¬متر ارتفاع داشته باشد و این به خاطر آن است که هنگام توزیع خوراک، کار راحت\u200Cتر انجام گیرد و هدر رفت خوراک به حداقل برسد. \n" +
                        "آخورها باید قابلیت شستشو داشته باشند و هر چند روز یکبار، کف آخور را شست و شو دهید تا از گندیدن و کپک زدن خوراک باقی مانده در آن جلوگیری شود.\n" +
                        "آبخوری از تجهیزات مهم دیگری است که باید در انتخاب آن دقت کنید. آبخوری باید قابل شستشو باشد. آب داخل آبخوری باید پاکیزه باشد. لازم است در طول شبانه روز آب کافی در اختیار بره ها باشد. در دسترس بودن همیشگی آب برای دام¬ها موجب هضم و جذب بهتر مواد غذایی در دستگاه گوارش می شود و سلامت بره¬ها به خطر نمی افتد. معمولا برای هر ۱۵ راس گوسفند باید ۴۵ سانتیمتر آبشخور در نظر گرفت. در صورت امکان از آبخوری\u200Cهای اتوماتیک در آغل استفاده کنید. \n" +
                        "مدیریت بستر یکی دیگر از مواردی است که توجه کردن به آن ضروری است. بهترین نوع بستر برای دام، پالت\u200Cهای پلاستیکی می\u200Cباشند. بسترهای بتنی بدترین نوع بستر می\u200Cباشند. بستر آغل با جنس موزاییک و سرامیک بدترین نوع بستر می¬باشد. اگر امکان استفاده از پالت پلاستیکی را در کف آغل ندارید، بستر آن را با خاک فشرده پوشانده به طوری که زیر این خاک فشرده قابلیت زهکشی وجود داشته باشد. تجمع ادرار و کود روی بستر و تجزیه آن می\u200Cتواند باعث تولید آمونیاک شده و بیماری پنومونی را در بره¬ها ایجاد کند. بنابراین، در حد امکان بستر باید خشک باشد. بستر دام\u200Cهای پرواری را مرتباً تمیز کنید و از تجمع کود جلوگیری کنید. پیشنهاد ما این است که هفته\u200Cای یک بار بستر را کودروبی کنید. \n" +
                        "برای هر بره، هشت دهم (8/0) متر مربع  فضای بستر سالن نیاز است. بنابراین، در هر ۸۰ متر مربع از بستر می\u200Cتوان صد راس بره را پروار کرد. فقط توجه کنید که این بستر مساحت سالن به جز مساحت آخورها و آبخوری و راهرو می\u200Cباشد.\n" +
                        "دمای جایگاه نیز بر افزایش وزن بره\u200Cها به شدت تاثیرگذار است. بهترین رنج دمایی برای آسایش بره\u200Cها ۱۵ تا ۲۵ درجه سانتی¬گراد می\u200Cباشد. برای کنترل دما در فصول گرم می\u200Cتوان از تجهیزات تبریدی مانند کولر، چیلر و سیستم پد کولینگ استفاده کرد. در فصول سرد نیز از بخاری و جت هیتر و گرما تاب\u200Cهای سقفی می\u200Cتوان استفاده کرد. توجه کنید که یکی از پارامترهایی که در آسایش دام تاثیر دارد عدم وزش باد در سالن است. بنابراین، در فصولی که دامداری در معرض باد قرار دارد می\u200Cتوانید از توری\u200Cهای بادشکن برای پنجره\u200Cها استفاده کنید. \n\n"
            )
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("نکاتی در مورد خوراک و تغذیه به منظور افزایش وزن بره\u200Cهای پرواری\n")
        }
        pop()

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                " خوراک مناسب برای دام باید دارای منابع انرژی، منابع پروتئینی، ویتامین\u200Cها، مواد معدنی و مواد فیبری یا الیافی باشند. دانه\u200Cهایی مانند جو، ذرت و گندم به عنوان منابع انرژی برای تغذیه بره\u200Cهای پرواری شناخته می\u200Cشوند. از منابع پروتئینی می\u200Cتوان به کنجاله سویا، کنجاله کلزا، کنجاله کنجد، پودر گوشت و غیره اشاره کرد. خوراک بره\u200Cهای پرواری باید طبق نیاز آن¬ها دارای منابع کافی از انرژی و پروتئین باشد. یونجه و کاه به عنوان منابع تامین فیبر در جیره بره\u200Cهای پرواری شناخته می\u200Cشوند که وجود آن¬ها در جیره باعث تحریک نشخوار کردن می\u200Cشود. نشخوار کردن باعث ترشح بیشتر بزاق شده و به خاطر خاصیت بافری بزاق، از اسیدوز در حیوان جلوگیری می\u200Cکند. \n" +
                        "اسیدوز به عنوان یکی از بیماری\u200Cهای بسیار مهم در دام\u200Cهایی شناخته می\u200Cشود که از کنسانتره بالایی در جیره آنها استفاده می\u200Cشود. کنسانتره به عنوان بخشی از خوراک است که به صورت فشرده در اختیار دام قرار داده می\u200Cشود و غنی از منابع انرژی، پروتئین به همراه بافرها، مواد معدنی و مواد ویتامینه می\u200Cباشد. در واقع، در خوراک دام کنسانتره به هر ترکیبی که منابع انرژی مانند جو، ذرت و گندم، منابع پروتئینی مانند کنجاله سویا، کنجد و.....، بافرها و مکمل\u200Cهای معدنی و ویتامینه با هم ترکیب شده باشند، گفته می\u200Cشود. بنابراین، توجه کنید که کنسانتره جزئی از خوراک است که خودتان نیز می\u200Cتوانید آن را بسازید.\n\n"
            )
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("فرمول پیشنهادی کنسانتره برای دوره پرواربندی\n")
        }
        pop()

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append("فرمول پیشنهادی کنسانتره و نحوه خوراک دهی در سیستم پرواربندی شرکت آراژن به صورت زیر می¬باشد:\n")
        }
    }
    val longText6 = buildAnnotatedString {
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append("نکته:\n دانه\u200Cهای گندم، جو و ذرت بصورت درسته(کامل) و بدون آسیاب کردن مخلوط خواهند شد.\n")
        }
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "این فرمولاسیون می\u200Cتواند بر اساس رفتار دام و قیمت نهاده\u200Cها تغییر کند. برای توضیح این تغییرات و برای اینکه خودتان بتوانید فرمولاسیون کنسانتره را به صورت موثر تغییر دهید، توجه کنید که ارزش غذایی گندم در خوراک دام بالاتر از ارزش غذایی ذرت و ارزش غذایی ذرت نیز بالاتر از ارزش غذایی جو می\u200Cباشد. در صورتی که تفاوت قیمت گندم با جو و ذرت بسیار بالا باشد می\u200Cتوان از سهم گندم تا ۱۰ درصد کاهش داد و به سهم جو و  به ویژه ذرت افزود. چنانچه بره\u200Cها علاقه بیشتری به مصرف ذرت یا جو داشته باشند، می\u200Cتوان از سهم یکی کم کرد و به سهم دانه\u200Cای که با علاقه بیشتری مصرف می\u200Cشود، اضافه کرد. این تغییر تا ۱۰ درصد وزنی می\u200Cتواند انجام شود. پیشنهاد ما این است که چنانچه می\u200Cخواهید بر اساس قیمت جو و ذرت از سهم یکی کم کنید و به سهم دیگری اضافه کنید، بهتر است که سهم ذرت را بیشتر از سهم جو در نظر بگیرید. چنانچه قیمت یکی از نهاده\u200Cهای ذرت و جو از آن یکی کمتر از ۱۰ درصد باشد، پیشنهاد می\u200Cشود که به جیره پیشنهادی دست نزده و تغییراتی برای این دو سهم ایجاد نکنید. در صورت استفاده از سوپرمیکس نیازی به استفاده از کنجاله سویا، مواد معدنی و بافرها در کنسانتره نمی\u200Cباشد.\n" +
                        "نکته\n پیشنهاد می\u200Cشود کل خوراک مورد نیاز یک دوره پرواربندی را به صورت یکجا خریداری کنید. زیرا تغییر خوراک در وسط دوره موجب پس زدن خوراک و عدم مصرف خوراک مناسب شده و در نتیجه افزایش وزن روزانه کاهش می\u200Cیابد. \n\n"
            )
        }
        pushStyle(ParagraphStyle(textAlign = TextAlign.Center))
        withStyle(
            style = SpanStyle(
                fontSize = 20.sp,
                color = colorResource(R.color.blue_logo)
            )
        ) {
            append("شروع دوره سازگاری\n")
        }
        pop()

        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                " بره\u200Cهایی که وارد دوره پرواربندی می\u200Cشوند به دو گروه قابل تقسیم بندی هستند. گروه اول بره\u200Cهای خریداری شده با خوراک مصرفی نامشخص (برای مثال بره¬های خریداری شده از میدان دام) و گروه دوم بره\u200Cهای پایه پروار که سابقه خوراک مصرفی آنها مشخص است (برای مثال از دامداری همسایه یا فامیل که سابقه خوراک مصرفی آنها در دسترس است) می\u200Cباشد. گروه دوم به سه زیر گروه به شرح زیر تقسیم می\u200Cشود. زیر گروه اول بره\u200Cهای مرتع¬رو هستند که در پس چر گندم و جو چرا کرده¬اند. زیر گروه دوم بره\u200Cهای مرتع رویی هستند که صرفاً علوفه مرتع مصرف کرده اند و زیر گروه سوم بره\u200Cهای حاصل از میش\u200Cهای گله خودتان می\u200Cباشند که به شکل دستی تغذیه شده اند. \n" +
                        "هنگامی که بره از گروه اول تهیه کردید (یعنی سابقه تغذیه بره در دسترس نیست)، بسیار دقت کنید که امکان دارد فروشنده به منظور افزایش وزن فروش، مقدار زیادی جو به بره ها خورانده باشد. بنابراین، در طی ۲۴ ساعت اول ورود بره¬ها به دامداری، توجه زیادی به رفتار خوردن و فضولات آن ها داشته باشید. بهتر است در طی این ۲۴ ساعت از دادن کنسانتره به بره¬ها خودداری کرده و با یونجه خرد شده تغذیه کنید. در صورت مشاهده اسهال و نفخ و همچنین بی \u200Cمیلی به خوردن خوراک، این دسته از بره\u200Cها را جدا کرده، قرنطینه نموده و درمان اسیدوز را شروع کنید. در بخش مربوط به پروتکل های درمانی به درمان اسیدوز به صورت مفصل پرداخته شده است. از روز دوم تغذیه، این بره\u200Cها را با ۱۰۰ گرم کنسانتره در روز شروع کنید. فردای روز دوم (روز سوم) نیز تنها ۱۰۰ گرم کنسانتره به بره دهید. روز چهارم میزان کنسانتره را 100 گرم افزایش دهید. بهترین روش عادت دهی بره ها به جیره های دان سالم به صورتی می باشد که هر دو روز یکبار، 100 گرم دانه را به جیره اضافه نمایید. به عبارت دیگر، روز اول، هیچ کنسانتره\u200Cای به بره داده نمی¬شود. روز دوم ۱۰۰ گرم کنسانتره به بره داده می\u200Cشود. روز سوم ۱۰۰ گرم و روز چهارم 200 گرم، روز پنجم 200 گرم و به همین ترتیب، هر دو روز یکبار 100 گرم افزایش میزان کنسانتره را در جیره روزانه بره\u200Cها خواهیم داشت.\n" +
                        "بره ها روزانه 4 درصد وزن بدن خود خوراک مصرف میکنند . در وعده صبح کنسانتره و سپس علوفه، در وعده ظهر کنسانتره و سپس علوفه و در وعده شب نیز ابتدا کنسانتره و سپس علوفه. \n\n" +
                        "به این مثال مهم توجه کنید:\n" +
                        "فرض کنید میانگین وزنی بره هایتان، 35 کیلوگرم است و تمام بره ها در گروه 35 کیلوگرم قرار می\u200Cگیرند. بنابراین 4 درصد وزن بدن آنها (یعنی وزن خوراک روزانه مورد نیاز) مقدار 1400 گرم (یک کیلو و چهارصد گرم) محاسبه می شود. بنابراین خوراک دهی را با این مقدار شروع می کنیم.  و مطابق جدول عادت دهی پیش میرویم.\n"
            )

        }

    }
    val longText7 = buildAnnotatedString {
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append("توجه شود که بره\u200Cها به صورت هفتگی وزن\u200Cکشی شده و بر اساس وزن بره\u200Cها خوراک مصرفی روزانه افزایش یابد(خوراک مصرفی روزانه باید 4 تا 5/4 درصد وزن بدن باشد).\n")
            append(
                "توجه شود که برهسنگ نمک: \n" +
                        "حتماً توجه کنید که سنگ نمک به صورت دائمی باید در اختیار بره\u200Cها قرار داشته باشد. سنگ نمک\u200Cها را به صورتی قرار دهید که توسط خوراک و یا کود بستر آلوده نشوند. سنگ نمک\u200Cها همیشه باید به صورت تمیز و در مکانی قرار بگیرند که دسترسی بره\u200Cها به سنگ نمک\u200Cها آسان باشد.\n" +
                        "به عنوان مثال می\u200Cتوانید سکوهایی را در کنار دیوار تعبیه کنید و سنگ نمک\u200Cها را بالای آن قرار دهید و یا سنگ نمک\u200Cها را سوراخ کرده و توسط سیم به محافظ بالای آخور و یا اطراف ستون\u200Cها آویزان کنید. برخی از دامداران به دلیل استفاده کردن نمک در داخل جیره بره\u200Cهای پرواری اقدام به حذف سنگ نمک از دامداری می\u200Cکنند که این اقدام به هیچ عنوان صحیح نمی\u200Cباشد.\n" +
                        "دلیل استفاده از سنگ نمک:\n" +
                        "لیسیدن سنگ نمک ترشح بزاق را به شدت تحریک می\u200Cکند و بزاق ترشح شده به کنترل اسیدوز کمک زیادی خواهد کرد. پس حتماً سنگ نمک به صورت دائمی در اختیار بره\u200Cها قرار داده شود. می\u200Cتوان به جای سنگ نمک، از آجرهای معدنی که مخلوط با نمک و یا گاهاً دارای ملاس و مواد معدنی هستند استفاده نمود. استفاده از آجرهای معدنی فسفردار برای بره\u200Cهای پرواری چندان توصیه نمی\u200Cشود مگر در موارد خاص که گله دچار خاک\u200Cخوری، پشم\u200Cخوری و... باشد.\n" +
                        "اسیدوز:\n" +
                        "اسیدوز یکی از بیماری\u200Cهای تغذیه\u200Cای بوده و در اثر مصرف بیش از حد مواد دانه\u200Cای مانند جو، گندم، ذرت و ... اتفاق می\u200Cافتد. چنانچه بدون عادت دهی و رعایت دوره سازگاری مقدار زیادی غلات در دسترس نشخوار کنندگان قرار گیرد، در اثر تخمیر در شکمبه، اسیدهای تولید شده محیط شکمبه را اسیدی خواهند کرد. چنانچه دانه غلات آرد و یا آسیاب شوند به دلیل تخمیر سریع\u200Cتر احتمال ایجاد اسیدوز به شدت افزایش پیدا خواهد کرد. دام\u200Cهای مبتلا به اسیدوز تمایل بسیار کمی به مصرف خوراک دارند اغلب از گله جدا شده به سمت آخور نمی\u200Cآیند، نفخ و اسهال میتواند از علائم اسیدوز شکمبه¬ای بوده و در مراحل شدیدتر، اسهال کاملاً آبکی همراه با موکوس خواهد بود. اسهال تنها در اثر اسیدوز اتفاق نمی\u200Cافتد و بسیاری از عوامل باکتریایی و ویروسی نیز می\u200Cتوانند موجب اسهال شوند. برای تشخیص تفاوت این دو نوع اسهال از یکدیگر یکی از بهترین راه\u200Cها سنجیدن تب حیوان می\u200Cباشد. دمای طبیعی بدن گوسفند 39.5 درجه است که در مواقع تب، دمای بدن به ۴۰ درجه و بالاتر می\u200Cرسد. برای سنجیدن تب حیوان حتماً از تب سنج\u200Cهای دیجیتال استفاده کنید. پس حتماً در داروخانه دامداریتان یک تب سنج دیجیتال دقیق داشته باشید.\n" +
                        "درمان اسیدوز:\n" +
                        " اولین اقدام در درمان اسیدوز کنترل مقدار کنسانتره مصرفی توسط حیوان است. مقدار کنسانتره مصرفی را کم کرده و تعداد وعده\u200Cهای توزیع خوراک را ۴ تا ۵ وعده کنید. در این حالت، کنسانتره مصرفی بین تعداد وعده¬ها تقسیم شده و مقدار کنسانتره مصرفی در هر وعده کاهش می\u200Cیابد. در مراحل شدیدتر، خوراندن جوش شیرین ۴ بار در روز و هر بار در حدود ۱۰ گرم مخلوط در آب توصیه می\u200Cشود. تزریق ویتامین ب ۱ به دام\u200Cهای درگیر اسیدوز در درمان این بیماری کمک شایانی می\u200Cکند. در موارد شدیدتر لازم است از تزریق سرم بی\u200Cکربنات استفاده گردد. لطفا توجه کنید که تمامی تزریقات طبق توصیه شرکت سازنده دارو انجام شود. به این نکته توجه نمایید که در بحث اسیدوز مهم\u200Cترین مسئله پیشگیری بوده و درمان آخرین اولویت را دارد. متاسفانه گله\u200Cهایی که به دلیل افزایش ناگهانی و بدون سازگاری کنسانتره درگیر اسیدوز می\u200Cشوند، در ادامه دوره پرواربندی افزایش وزن مناسب و سلامت کافی را نخواهند داشت. پس حتماً افزایش کنسانتره را به تدریج انجام داده و رفتار حیوان را در مصرف خوراک تحت نظر داشته باشید.\n" +
                        "توجه: درمان اسیدوز در مواقعی که دمای بدن حیوان کاهش زیادی داشته و تعداد ضربان قلب بیش از 120 بار در دقیقه باشد، به درمان پاسخ مناسبی نخواهد داد.\n" +
                        "نفخ:\n" +
                        "یکی دیگر از بیماری\u200Cهای تغذیه\u200Cای که گاها همزمان با اسیدوز اتفاق می\u200Cافتد نفخ است. تجمع گاز در شکمبه حیوان موجب نفخ شده که به شدت حیوان را مستعد تلفات خواهد کرد. در صورت مشاهده نفخ در حیوان می\u200Cتوان به چند طریق اقدام به درمان کرد. روش اول خوراندن روغن پارافین طبق دستور شرکت سازنده می\u200Cباشد. روش دوم خوراندن شربت بلوترول و روش سوم که در مراحل شدیدتر مورد استفاده قرار می\u200Cگیرد زدن تروکار به شکمبه جهت تخلیه گاز تجمع یافته در شکمبه می\u200Cباشد. دامداران به صورت سنتی روشی برای درمان نفخ دارند که تکه چوبی را به دهان بره می\u200Cبندند که بره با جویدن این چوب و تکان دادن دهان بزاق زیادی ترشح می\u200Cکند که این بزاق به رفع نفخ کمک خواهد کرد. \n" +
                        "نوع دیگری از نفخ که در اثر خوردن علوفه تر مخصوصا یونجه تر اتفاق می\u200Cافتد نفخ کفی است که برای درمان آن باید از خوراندن روغن هایی مانند پارافین استفاده کرد.\n" +
                        "تزریقات در طول دوره پرواربندی:\n" +
                        "با توجه به اینکه امکان افزودن برخی ویتامین¬ها به سوپرمیکس وجود ندارد (به علت دمای زیاد در فرایند تهیه پلت)، نیاز است در کنار کنسانتره ساخته شده بعضی از ویتامین¬ها را به بره¬ها تزریق کنید. در اینجا به شرح تزریقات مورد نیاز پرداخته شده است.\n" +
                        " تزریق ویتامین ب ۱۲- ۱۰۰۰ دامی: این ویتامین برای افزایش اشتها و افزایش متابولیسم در حیوان و عضله\u200Cسازی بیشتر به صورت هفتگی تزریق خواهد شد. مقدار تزریق این ویتامین ۱ تا ۲ سی¬سی به ازای هر راس و به صورت عضلانی می\u200Cباشد. از تزریق ویتامین\u200Cهایی مانند نوروبیون که به منظور مصارف انسانی تولید می\u200Cشوند، خودداری نمایید.\n" +
                        "تزریق ویتامین آ د۳ ای و ای سلنیوم: این ویتامین\u200Cها در اول دوره پرواربندی تزریق شده و هر ۱۴ روز یکبار تکرار می\u200Cشود. این ویتامین\u200Cها ترجیحاً به صورت زیر جلدی تزریق شده و به ازای هر ۱۰ کیلوگرم وزن بدن حیوان، یک سی سی تزریق نمایید. توجه داشته باشید که در تمامی تزریقات از سرنگ\u200Cهای تمیز و استریل استفاده کنید و سرنگ\u200Cهایی که چندین بار استفاده شده\u200Cاند، خودداری نمایید و ترجیحاً از هر ده راس سرسوزن را تعویض نمایید\u200C. در زمان\u200Cهایی که تنش گرمایی وجود دارد می\u200Cتوانید از ویتامین c مانند ویتاسول استفاده کنید. ویتامین سی نقش بسزایی در کنترل تنش گرمایی دارد. به این نکته مهم توجه کنید که فضای کوچکی را برای مهار حیوان در نظر بگیرید تا از دنبال کردن حیوان و وارد کردن استرس به حیوان جلوگیری کرده و افزایش وزن روزانه تحت تاثیر قرار نگیرد.\n" +
                        "2-بره\u200Cها با مصرف خوراک مشخص:\n" +
                        "در بره\u200Cهایی که مقدار خوراک مصرفی و ترکیب خوراک مصرفی آنها مشخص است، چنانچه خوراک مصرفی آنها دارای کنسانتره بوده است باید کنسانتره مصرفی قبلی با کنسانتره دارای سوپرمیکس ترکیب جدید به آرامی جایگزین شود. به عنوان مثال بره\u200Cهایی را در نظر بگیرید که روزانه یک کیلوگرم خوراک استارتر مصرف می\u200Cکردند. در اینجا روزانه ۱۰۰ گرم از خوراک استارتر قبلی کم کرده و ۱۰۰ گرم از کنسانتره دارای سوپرمیکس به آن اضافه می\u200Cکنیم. از آنجایی که با افزایش وزن و سن حیوان باید خوراک مصرفی آن نیز افزایش پیدا کند، می\u200Cتوانیم در ادامه با کم کردن ۱۰۰ گرم از کنسانتره قبلی حدود ۱۵۰ تا ۲۰۰ گرم از کنسانتره جدید را جایگزین آن کنیم در این صورت هم خوراک قبلی با خوراک جدید جایگزین شده و هم مقدار کل خوراک مصرفی در یک روز افزایش خواهد یافت.\n"
            )
        }
    }

    val longText8 = buildAnnotatedString {
        withStyle(
            style = SpanStyle(
                fontSize = 17.sp,
                color = Color.Black
            )
        ) {
            append(
                "بره\u200Cهایی که در پس چر غلات مانند گندم و جو چرا کرده\u200Cاند:\n" +
                        " از آنجایی که مقدار جو و یا گندم مصرفی توسط این بره\u200Cها مشخص نیست، نمی\u200Cتوان سازگاری را با مقدار زیادی کنسانتره شروع کرد. اما چون این بره\u200Cها در پس چر گندم یا جو چرا کرده¬اند، شکمبه آنها به مصرف غلات تقریباً عادت کرده و سریع\u200Cتر سازگار خواهند شد. در این بره\u200Cها به عنوان مثال اگر ۴۰ کیلوگرم وزن داشته باشند، می\u200Cتوان کنسانتره را از ۳۰۰ تا ۵۰۰ گرم در روز شروع کرده و روزانه ۵۰ گرم یا هر دو روز یکبار 100 گرم افزایش داد. توجه داشته باشید چنانچه مقدار کنسانتره مصرفی در این حیوانات را کمتر در نظر بگیرید باعث کاهش وزن در آنها خواهد شد.\n" +
                        "بره\u200Cهای مرتع رو که صرفاً علوفه مرتع را مصرف کرده\u200Cاند:\n" +
                        "این بره\u200Cها نیز همانند بره\u200Cهای خریداری شده از میدان دام با مصرف نامشخص بوده و چون عادت به مصرف کنسانتر ندارند باید سازگاری با مقدار کنسانتری کمی شروع شود. بهتر است سازگاری در این بره\u200Cها با ۵۰ تا ۱۰۰ گرم کنسانتره در روز شروع شده و روزانه ۵۰ گرم به کنسانتره یا 100 گرم کنسانتره هر دو روز اضافه شود.\n" +
                        "شکل فیزیکی علوفه:\n" +
                        "مصرف علوفه به منظور افزایش نشخوار و جلوگیری از اسیدوز لازم است. ولی در این روش و با استفاده از سوپرمیکس به مقدار بسیار کمی علوفه در جیره روزانه نیاز داریم. می\u200Cتوان از علوفه\u200Cهایی مانند یونجه، سیلوی ذرت، و یا مخلوطی از سیلوی ذرت، یونجه و کاه استفاده نمود. بهترین گزینه به عنوان علوفه، سیلوی ذرت پُر دان است که با ترکیب کردن مقداری کاه به آن تمام نیاز به فیبر حیوان را تامین می\u200Cکند و همچنین به شدت خوش خوراک است. توجه داشته باشید که قطعات یونجه حداقل دو بند انگشت و یا حدود ۵ تا ۷ سانت طول داشته باشند.\n" +
                        "وزن کشتار:\n" +
                        "به منظور جلوگیری از چرب شدن لاشه و هزینه اضافی خوراک در دوران سازگاری لازم است وزن کشتار بره\u200Cها را رعایت نمایید. بره¬ها پس از ۲۰ تا ۲۵ کیلوگرم افزایش وزن باید فروخته شوند زیرا در صورت سنگین شدن لاشه ضریب تبدیل حیوان بالا رفته و مقدار افزایش وزن روزانه کاهش می\u200Cیابد. چنانچه بره\u200Cها در وزن مناسبی به فروش نرسند از میزان بازارپسندی آنها کاسته خواهد شد. البته توجه کنید که بازار پسندی، بیشتر به منطقه پرورش حیوان بستگی دارد و در بعضی از مناطق لاشه\u200Cهای سنگین\u200Cتر، مورد پسند است ولی در اغلب مناطق لاشه\u200Cهای سبک\u200Cتر بهتر فروش می\u200Cروند. بهتر است در نژادهایی مانند افشاری بره\u200Cهای پای پروار که در وزن ۳۵ کیلوگرم خریداری می\u200Cشوند، پس از پروار شدن در وزن ۵۵ تا ۶۰ کیلو به فروش برسند. زیرا پس از این وزن مقدار افزایش وزن روزانه کمتر شده و خوراک مصرفی نسبت به افزایش وزن حیوان بیشتر خواهد شد، در نتیجه ضریب تبدیل خوراک افزایش پیدا کرده و حیوان برای یک کیلوگرم افزایش وزن زنده مقدار بیشتری خوراک مصرف می\u200Cکند. نکته بسیار مهم این است که از پروار کردن بره¬ها بیشتر از 80 روز خودداری نمایید.\n" +
                        "مباحث اقتصادی پرواربندی :\n" +
                        "حدود ۷۰ درصد از هزینه\u200Cهای پرواربندی را هزینه¬های خوراک تشکیل می\u200Cدهد. از این جهت، توجه به کیفیت خوراک و ضریب تبدیل خوراک از اهمیت ویژه\u200Cای برخوردار است. از طرفی باید کمترین هدرروی را در خوراک داشته باشیم. اولین موردی که در پرواربندی از اهمیت ویژه\u200Cای برخوردار است ضریب تبدیل خوراک می\u200Cباشد. ضریب تبدیل از تقسیم کردن مقدار خوراک مصرفی به افزایش وزن روزانه به دست می\u200Cآید. به عنوان مثال دامی که در روز ۲ کیلوگرم خوراک خورده و ۴۰۰ گرم وزن اضافه کرده است، ضریب تبدیل ۵ دارد (از تقسیم عدد 2 به عدد 0.400 ضریب تبدیل معادل 5 به دست می¬آید)، به عبارت دیگر، به ازای هر یک کیلوگرم افزایش وزن، این بره ۵ کیلوگرم خوراک مصرف کرده است. اگر قیمت هر کیلوگرم خوراک را ۱۵ هزار تومان در نظر بگیریم، این حیوان به ازای هر یک کیلوگرم افزایش وزن زنده ۷۵ هزار تومان خوراک مصرف کرده است. هر چقدر عدد این ضریب تبدیل پایین\u200Cتر باشد نشان دهنده عملکرد بهتر حیوان، در پرواربندی است و در نتیجه سود بیشتری حاصل خواهد شد.\n" +
                        "مورد بعدی، میانگین افزایش وزن روزانه می\u200Cباشد، که هر چقدر افزایش وزن روزانه بیشتر باشد طول دوره پرواربندی کوتاه\u200Cتر شده و در سال بره\u200Cهای بیشتری می\u200Cتوان پرواربندی کرد. برای مثال اگر سود حاصل از هر دوره پرواربندی ۲۰ درصد سرمایه باشد با سه بار پرواربندی در سال ۶۰ درصد سود و با ۵ بار پرواربندی در سال ۱۰۰ درصد سود حاصل خواهد شد. با استفاده از سوپرمیکس می\u200Cتوان ضریب تبدیل را به کمتر از ۶ و طول دوره پرواربندی را به ۵۰ تا ۷۵ روز رساند.\n" +
                        "طول دوره پرواربندی:\n" +
                        " طول دوره پرواربندی عدد ثابتی نیست و به افزایش وزن روزانه وابسته است. به عنوان مثال در بالا اشاره کردیم که هر بره با افزایش ۲۰ تا ۲۵ کیلوگرم وزن باید به فروش برسد. اگر افزایش وزن روزانه ۳۰۰ گرم باشد چیزی در حدود ۶۷ روز طول می\u200Cکشد تا حیوان ۲۰ کیلوگرم وزن اضافه کند، اما اگر افزایش وزن به ۴۲۰ گرم در روز افزایش پیدا بکند طول دوره به حدود ۴۸ روز کاهش پیدا خواهد کرد. \n"
            )
        }
    }

    LazyColumn(
        modifier = Modifier
            .fillMaxSize()
            .padding(16.dp),
        contentPadding = PaddingValues(8.dp),

        horizontalAlignment = Alignment.CenterHorizontally
    ) {
        item {
            Text(
                text = longText1,
                lineHeight = 30.sp,
                style = TextStyle(
                    fontFamily = FontFamily(Font(R.font.sans_bold)),
                    fontSize = 20.sp,
                    textDirection = TextDirection.Rtl, textAlign = TextAlign.Justify
                ),
                modifier = Modifier.fillMaxWidth()
            )

            Row(
                modifier = Modifier.fillMaxWidth(),
                horizontalArrangement = Arrangement.SpaceBetween
            ) {
                Column(modifier = Modifier.weight(1f)) {
                    Image(
                        painter = painterResource(R.drawable.img_3),
                        "",
                        modifier = Modifier
                            .fillMaxWidth()
                            .size(150.dp)
                    )
                    Text(
                        text = "محل نامناسب نصب پلاک",
                        textAlign = TextAlign.Center,
                        modifier = Modifier.fillMaxWidth(1f)
                    )
                }

                Column(modifier = Modifier.weight(1f)) {
                    Image(
                        painter = painterResource(R.drawable.img_4),
                        "",
                        modifier = Modifier
                            .fillMaxWidth()
                            .size(150.dp)
                    )
                    Text(
                        text = "محل مناسب نصب پلاک",
                        textAlign = TextAlign.Center,
                        modifier = Modifier.fillMaxWidth(1f)
                    )
                }

            }

            Spacer(modifier = Modifier.height(40.dp))

            Text(
                text = longText2,
                lineHeight = 30.sp,
                style = TextStyle(
                    fontFamily = FontFamily(Font(R.font.sans_bold)),
                    fontSize = 20.sp,
                    textDirection = TextDirection.Rtl, textAlign = TextAlign.Justify
                ),
                modifier = Modifier.fillMaxWidth()
            )

            Row(
                modifier = Modifier.fillMaxWidth(),
                horizontalArrangement = Arrangement.SpaceBetween
            ) {
                Column(modifier = Modifier.weight(1f)) {
                    Image(
                        painter = painterResource(R.drawable.img_5),
                        "",
                        modifier = Modifier
                            .fillMaxWidth(1f)
                            .size(100.dp)
                    )
                    Text(
                        text = "حیوان مبتلا به جرب",
                        textAlign = TextAlign.Center,
                        modifier = Modifier.fillMaxWidth(1f)
                    )
                }

                Column(modifier = Modifier.weight(1f)) {
                    Image(
                        painter = painterResource(R.drawable.img_6),
                        "",
                        modifier = Modifier
                            .fillMaxWidth(1f)
                            .size(100.dp)
                    )
                    Text(
                        text = "کنه",
                        textAlign = TextAlign.Center,
                        modifier = Modifier.fillMaxWidth(1f)
                    )
                }
            }
            Spacer(modifier = Modifier.height(40.dp))
            Text(
                text = longText3,
                lineHeight = 30.sp,
                style = TextStyle(
                    fontFamily = FontFamily(Font(R.font.sans_bold)),
                    fontSize = 20.sp,
                    textDirection = TextDirection.Rtl, textAlign = TextAlign.Justify
                ),
                modifier = Modifier.fillMaxWidth()
            )

            Row(
                modifier = Modifier.fillMaxWidth(),
                horizontalArrangement = Arrangement.Center
            ) {
                Column {
                    Image(
                        painter = painterResource(R.drawable.img_7),
                        "",
                        modifier = Modifier
                            .fillMaxWidth()
                            .size(200.dp)
                    )
                    Text(
                        "حمام کنه", textAlign = TextAlign.Center,
                        modifier = Modifier.fillMaxWidth(1f)
                    )
                }
            }
            Spacer(modifier = Modifier.height(40.dp))
            Text(
                text = longText4,
                lineHeight = 30.sp,
                style = TextStyle(
                    fontFamily = FontFamily(Font(R.font.sans_bold)),
                    fontSize = 20.sp,
                    textDirection = TextDirection.Rtl, textAlign = TextAlign.Justify
                ),
                modifier = Modifier.fillMaxWidth()
            )
            Spacer(modifier = Modifier.height(40.dp))
            Row(
                modifier = Modifier.fillMaxWidth(),
                horizontalArrangement = Arrangement.Center
            ) {
                Column {
                    Image(
                        painter = painterResource(R.drawable.img_8),
                        "",
                        modifier = Modifier
                            .fillMaxWidth()
                            .size(200.dp)
                    )
                    Text(
                        "قارچ پوستی", textAlign = TextAlign.Center,
                        modifier = Modifier.fillMaxWidth(1f)
                    )
                }
            }
            Spacer(modifier = Modifier.height(40.dp))
            Text(
                text = longText5,
                lineHeight = 30.sp,
                style = TextStyle(
                    fontFamily = FontFamily(Font(R.font.sans_bold)),
                    fontSize = 20.sp,
                    textDirection = TextDirection.Rtl, textAlign = TextAlign.Justify
                ),
                modifier = Modifier.fillMaxWidth()
            )
            Spacer(modifier = Modifier.width(40.dp))
            Row(
                modifier = Modifier.fillMaxWidth(),
                horizontalArrangement = Arrangement.Center
            ) {
                Image(
                    painter = painterResource(R.drawable.img_9),
                    "",
                    modifier = Modifier
                        .fillMaxWidth()
                        .size(200.dp)
                )
            }
            Spacer(modifier = Modifier.height(40.dp))
            Text(
                text = longText6,
                lineHeight = 30.sp,
                style = TextStyle(
                    fontFamily = FontFamily(Font(R.font.sans_bold)),
                    fontSize = 20.sp,
                    textDirection = TextDirection.Rtl, textAlign = TextAlign.Justify
                ),
                modifier = Modifier.fillMaxWidth()
            )
            Spacer(modifier = Modifier.width(40.dp))
            Row(
                modifier = Modifier.fillMaxWidth(),
                horizontalArrangement = Arrangement.Center
            ) {
                Image(
                    painter = painterResource(R.drawable.img_10),
                    "",
                    modifier = Modifier
                        .fillMaxWidth()
                        .size(250.dp)
                )
            }
            Spacer(modifier = Modifier.height(40.dp))
            Row(
                modifier = Modifier.fillMaxWidth(),
                horizontalArrangement = Arrangement.Center
            ) {
                Image(
                    painter = painterResource(R.drawable.img_11),
                    "",
                    modifier = Modifier
                        .fillMaxWidth()
                        .size(250.dp)
                )
            }
            Spacer(modifier = Modifier.height(40.dp))
            Row(
                modifier = Modifier.fillMaxWidth(),
                horizontalArrangement = Arrangement.Center
            ) {
                Image(
                    painter = painterResource(R.drawable.img_12),
                    "",
                    modifier = Modifier
                        .fillMaxWidth()
                        .size(250.dp)
                )
            }

            Spacer(modifier = Modifier.height(40.dp))
            Row(
                modifier = Modifier.fillMaxWidth(),
                horizontalArrangement = Arrangement.Center
            ) {
                Image(
                    painter = painterResource(R.drawable.img_13), "",
                    modifier = Modifier
                        .fillMaxWidth()
                        .size(250.dp)
                )
            }
            Spacer(modifier = Modifier.height(40.dp))
            Text(
                text = longText7,
                lineHeight = 30.sp,
                style = TextStyle(
                    fontFamily = FontFamily(Font(R.font.sans_bold)),
                    fontSize = 20.sp,
                    textDirection = TextDirection.Rtl, textAlign = TextAlign.Justify
                ),
                modifier = Modifier.fillMaxWidth()
            )
            Spacer(modifier = Modifier.height(40.dp))
            Row(
                modifier = Modifier.fillMaxWidth(),
                horizontalArrangement = Arrangement.Center
            ) {
                Image(
                    painter = painterResource(R.drawable.img_14), "",
                    modifier = Modifier
                        .fillMaxWidth()
                        .size(250.dp)
                )
            }
            Spacer(modifier = Modifier.height(40.dp))
            Text(
                text = longText8,
                lineHeight = 30.sp,
                style = TextStyle(
                    fontFamily = FontFamily(Font(R.font.sans_bold)),
                    fontSize = 20.sp,
                    textDirection = TextDirection.Rtl, textAlign = TextAlign.Justify
                ),
                modifier = Modifier.fillMaxWidth()
            )
        }
    }
}

@Composable
fun ZoomableImage(painter: Int) {
    var scale by remember { mutableStateOf(1f) }
    var scaleState by remember { mutableStateOf(2f) }
    val coroutineScope = rememberCoroutineScope()

    // Animate the scale back to 1 when released
    val animatedScale by animateFloatAsState(
        targetValue = scaleState,
        animationSpec = tween(durationMillis = 300) // Duration of the animation
    )

    Box(
        modifier = Modifier
            .fillMaxSize()
            .pointerInput(Unit) {
                detectTransformGestures { _, pan, zoom, _ ->
                    // Apply zoom on each transform gesture
                    scale *= zoom
                }
            }
    ) {
        Image(
            painter = painterResource(id = painter), // Replace with your image
            contentDescription = "Zoomable Image",
            modifier = Modifier
                .fillMaxSize()
                .graphicsLayer(
                    scaleX = animatedScale,
                    scaleY = animatedScale,
                )
        )

        // Reset the scale when zooming stops
        LaunchedEffect(scale) {
            if (scale == 1f) {
                scaleState = 1f // Set scaleState to 1 when released
            } else {
                scaleState = scale
            }
        }
    }
}
